OpenFOAM/benchmark_cases_LiPb/probe-out-laminar/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     incompressibleFluid;

startFrom       latestTime;

startTime       44;

stopAt          endTime;

endTime         301;          // Number of iterations for steady-state

deltaT          0.05;            // Time step (irrelevant for steady-state, but kept)

writeControl    adjustableRunTime;

writeInterval   10;         // Write every 10 iterations

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

// Optional: control max Co for adjustable time stepping (not typically needed for simpleFoam)
adjustTimeStep  no;

maxCo           10.0;

// ************************************************************************* //y

